emas/loadtest/emas-performance-report/raw_data/sp4/apache_bench_data/750cus/varnish_ab_test_750_1000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      750
Time taken for tests:   11.929 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      32552000 bytes
HTML transferred:       31966000 bytes
Requests per second:    83.83 [#/sec] (mean)
Time per request:       8946.793 [ms] (mean)
Time per request:       11.929 [ms] (mean, across all concurrent requests)
Transfer rate:          2664.84 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   54  74.4     14     220
Processing:   441 3835 4284.0   1388   11904
Waiting:        5 2711 4282.8    374   11898
Total:        647 3889 4262.4   1400   11909

Percentage of the requests served within a certain time (ms)
  50%   1400
  66%   1967
  75%   8611
  80%  10989
  90%  11261
  95%  11400
  98%  11506
  99%  11614
 100%  11909 (longest request)